bit-finance/InformationRegisters/бит_НастройкиДоступностиЭлементов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_НастройкиДоступностиЭлементов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УбратьВидимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТолькоПросмотр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обязательное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеБлокироватьСостояниемДокумента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидЭлемента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыЭлементовУправления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектСистемы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроизвольноеУсловие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПользовательскиеУсловия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяЭлементаУправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

bit-finance/Enums/бит_ВидыЭлементовУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыЭлементовУправления</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВсяФорма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГруппаФормы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолеФормы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТаблицаФормы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КнопкаФормы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДекорацияФормы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоманднаяПанель</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/InformationRegisters/бит_НастройкиДоступностиЭлементов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьНастройкиПоУмолчаниюПриОбновлении3_1_54_2() Экспорт
	
	Менеджер = РегистрыСведений.бит_НастройкиДоступностиЭлементов.СоздатьМенеджерЗаписи();
	Менеджер.ОбъектСистемы                    = Справочники.бит_ОбъектыСистемы.ОбъектСистемыПоПолномуИмени(
													Метаданные.Справочники.бит_ВнутренниеДокументы.ПолноеИмя());
	Менеджер.Пользователь                     = Справочники.ГруппыПользователей.ВсеПользователи;
	Менеджер.ИмяЭлементаУправления            = "ФормаКомандаОтправитьНаСогласование";
	Менеджер.НеБлокироватьСостояниемДокумента = Истина;
	Менеджер.ВидЭлемента                      = Перечисления.бит_ВидыЭлементовУправления.КнопкаФормы;
	Менеджер.Записать();
	
КонецПроцедуры

Процедура ЗаменитьНастройкиДополнительныхРеквизитовПриОбновлении3_1_44_5() Экспорт
	
	ПрефиксИмениСлужебногоПоляДопРеквизита = "ДополнительныйРеквизитЗначение_";
	ДлинаИмениСлужебногоПоляДопРеквизита   = 104;
	ЧислоЗначимыхСимволовДопРеквизита      = 36; // GUID свойства.
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_НастройкиДоступностиЭлементов.ОбъектСистемы КАК ОбъектСистемы,
	|	бит_НастройкиДоступностиЭлементов.Пользователь КАК Пользователь,
	|	бит_НастройкиДоступностиЭлементов.ПроизвольноеУсловие КАК ПроизвольноеУсловие,
	|	бит_НастройкиДоступностиЭлементов.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.бит_НастройкиДоступностиЭлементов КАК бит_НастройкиДоступностиЭлементов
	|ГДЕ
	|	бит_НастройкиДоступностиЭлементов.ИмяЭлементаУправления ПОДОБНО ""ДополнительныйРеквизитЗначение%""";
	ВыборкаИзмерений = Запрос.Выполнить().Выбрать();
	Пока ВыборкаИзмерений.Следующий() Цикл
		БылиПравки = Ложь;
		Набор = РегистрыСведений.бит_НастройкиДоступностиЭлементов.СоздатьНаборЗаписей();
		Набор.Отбор.ОбъектСистемы.Установить(ВыборкаИзмерений.ОбъектСистемы);
		Набор.Отбор.Пользователь.Установить(ВыборкаИзмерений.Пользователь);
		Набор.Отбор.ПроизвольноеУсловие.Установить(ВыборкаИзмерений.ПроизвольноеУсловие);
		Набор.Отбор.Статус.Установить(ВыборкаИзмерений.Статус);
		Набор.Прочитать();
		Для каждого ЗаписьНабора Из Набор Цикл
			ИмяЭлемента = ЗаписьНабора.ИмяЭлементаУправления;
			Если СтрНачинаетсяС(ИмяЭлемента, ПрефиксИмениСлужебногоПоляДопРеквизита)
				И СтрДлина(ИмяЭлемента) = ДлинаИмениСлужебногоПоляДопРеквизита Тогда
				ИмяЭлемента = ПрефиксИмениСлужебногоПоляДопРеквизита + Прав(ИмяЭлемента, ЧислоЗначимыхСимволовДопРеквизита);
				ЗаписьНабора.ИмяЭлементаУправления = ИмяЭлемента;
				БылиПравки = Истина;
			КонецЕсли;
		КонецЦикла;
		Если БылиПравки Тогда
			Попытка
				ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(Набор);
			Исключение
				ТекстОшибки = НСтр("ru='Не удалось заменить настройку доступности для дополнительного реквизита %1 по причине:
									|%2'");
				ТекстОшибки = СтрШаблон(ТекстОшибки, ВыборкаИзмерений.ОбъектСистемы,
							ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Обновление ИБ'", ОбщегоНазначения.КодОсновногоЯзыка()),
					УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
